In [1]:
from pymongo import MongoClient

In [2]:
client = MongoClient(
    host = 'localhost',
    port = 27017
)

In [3]:
client.list_database_names()

['admin', 'config', 'local', 'ubion']

In [4]:
db = client["ubion"]
list(db["test"].find())

[{'_id': ObjectId('62328e7688460e6c2eeb343f'),
  'name': 'test',
  'phone': '01012345678'},
 {'_id': ObjectId('6232905288460e6c2eeb3441'), 'loc': 'Seoul'},
 {'_id': ObjectId('6232905288460e6c2eeb3442'),
  'gender': 'male',
  'age': 20.0,
  'hobby': 'soccer'},
 {'_id': ObjectId('6232919388460e6c2eeb3443'), 'name': 'test2', 'age': 40.0},
 {'_id': ObjectId('623297d8801b914908fa80af'), '1': '1', '2': '2', '3': '3'},
 {'_id': ObjectId('623299c9801b914908fa80b0'), '1': '2'},
 {'_id': ObjectId('623299c9801b914908fa80b1'), '3': '4'}]

In [5]:
data = {
    "1" : "1",
    "2" : "2",
    "3" : "3"
}

db.test.insert_one(data)

In [6]:
### data 변수 만들어서 insert_many 를 사용해볼것!
data = [{
    "1":"2"
}, 
{
    "3" : "4"
}]

db.test.insert_many(data)

In [7]:
list(db.test.find())

[{'_id': ObjectId('62328e7688460e6c2eeb343f'),
  'name': 'test',
  'phone': '01012345678'},
 {'_id': ObjectId('6232905288460e6c2eeb3441'), 'loc': 'Seoul'},
 {'_id': ObjectId('6232905288460e6c2eeb3442'),
  'gender': 'male',
  'age': 20.0,
  'hobby': 'soccer'},
 {'_id': ObjectId('6232919388460e6c2eeb3443'), 'name': 'test2', 'age': 40.0},
 {'_id': ObjectId('623297d8801b914908fa80af'), '1': '1', '2': '2', '3': '3'},
 {'_id': ObjectId('623299c9801b914908fa80b0'), '1': '2'},
 {'_id': ObjectId('623299c9801b914908fa80b1'), '3': '4'},
 {'_id': ObjectId('6232bc540b668bb568312842'), '1': '1', '2': '2', '3': '3'},
 {'_id': ObjectId('6232bc540b668bb568312843'), '1': '2'},
 {'_id': ObjectId('6232bc540b668bb568312844'), '3': '4'}]

In [8]:
db.name

'ubion'

In [9]:
db.list_collection_names

In [10]:
db

Database(MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True), 'ubion')

In [11]:
db.test2.insert_many(
    [
        {'number' : i} for i in range(10)
    ]
)

In [12]:
list(db.test2.find())

[{'_id': ObjectId('6232b091801b914908fa80b2'), 'number': 0},
 {'_id': ObjectId('6232b091801b914908fa80b3'), 'number': 1},
 {'_id': ObjectId('6232b091801b914908fa80b4'), 'number': 2},
 {'_id': ObjectId('6232b091801b914908fa80b5'), 'number': 3},
 {'_id': ObjectId('6232b091801b914908fa80b6'), 'number': 4},
 {'_id': ObjectId('6232b091801b914908fa80b7'), 'number': 5},
 {'_id': ObjectId('6232b091801b914908fa80b8'), 'number': 6},
 {'_id': ObjectId('6232b091801b914908fa80b9'), 'number': 7},
 {'_id': ObjectId('6232b091801b914908fa80ba'), 'number': 8},
 {'_id': ObjectId('6232b091801b914908fa80bb'), 'number': 9},
 {'_id': ObjectId('6232bc540b668bb568312845'), 'number': 0},
 {'_id': ObjectId('6232bc540b668bb568312846'), 'number': 1},
 {'_id': ObjectId('6232bc540b668bb568312847'), 'number': 2},
 {'_id': ObjectId('6232bc540b668bb568312848'), 'number': 3},
 {'_id': ObjectId('6232bc540b668bb568312849'), 'number': 4},
 {'_id': ObjectId('6232bc540b668bb56831284a'), 'number': 5},
 {'_id': ObjectId('6232bc540b668bb56831284b'), 'number': 6},
 {'_id': ObjectId('6232bc540b668bb56831284c'), 'number': 7},
 {'_id': ObjectId('6232bc540b668bb56831284d'), 'number': 8},
 {'_id': ObjectId('6232bc540b668bb56831284e'), 'number': 9}]

In [13]:
import mod_sql
import pandas as pd
import pprint

In [14]:
_db = mod_sql.Database()

In [15]:
sql = """
        SELECT * FROM emp
    """
result = _db.executeAll(sql)
pd.DataFrame(result).to_csv("emp.csv")

In [16]:
pd.read_csv("emp.csv").to_dict()

{'Unnamed: 0': {0: 0,
  1: 1,
  2: 2,
  3: 3,
  4: 4,
  5: 5,
  6: 6,
  7: 7,
  8: 8,
  9: 9,
  10: 10,
  11: 11,
  12: 12,
  13: 13},
 'EMPNO': {0: 7369,
  1: 7499,
  2: 7521,
  3: 7566,
  4: 7654,
  5: 7698,
  6: 7782,
  7: 7788,
  8: 7839,
  9: 7844,
  10: 7876,
  11: 7900,
  12: 7902,
  13: 7934},
 'ENAME': {0: 'SMITH',
  1: 'ALLEN',
  2: 'WARD',
  3: 'JONES',
  4: 'MARTIN',
  5: 'BLAKE',
  6: 'CLARK',
  7: 'SCOTT',
  8: 'KING',
  9: 'TURNER',
  10: 'ADAMS',
  11: 'JAMES',
  12: 'FORD',
  13: 'MILLER'},
 'JOB': {0: 'CLERK',
  1: 'SALESMAN',
  2: 'SALESMAN',
  3: 'MANAGER',
  4: 'SALESMAN',
  5: 'MANAGER',
  6: 'MANAGER',
  7: 'ANALYST',
  8: 'PRESIDENT',
  9: 'SALESMAN',
  10: 'CLERK',
  11: 'CLERK',
  12: 'ANALYST',
  13: 'CLERK'},
 'MGR': {0: 7902.0,
  1: 7698.0,
  2: 7698.0,
  3: 7839.0,
  4: 7698.0,
  5: 7839.0,
  6: 7839.0,
  7: 7566.0,
  8: nan,
  9: 7698.0,
  10: 7788.0,
  11: 7698.0,
  12: 7566.0,
  13: 7782.0},
 'HIREDATE': {0: '1980-12-17',
  1: '1981-02-20',
  2: '1981-02-22',
  3: '1981-04-02',
  4: '1981-09-28',
  5: '1981-05-01',
  6: '1981-06-09',
  7: '1987-06-28',
  8: '1981-11-17',
  9: '1981-09-08',
  10: '1987-07-13',
  11: '1981-12-03',
  12: '1981-12-03',
  13: '1982-01-23'},
 'SAL': {0: 800.0,
  1: 1600.0,
  2: 1250.0,
  3: 2975.0,
  4: 1250.0,
  5: 2850.0,
  6: 2450.0,
  7: 3000.0,
  8: 5000.0,
  9: 1500.0,
  10: 1100.0,
  11: 950.0,
  12: 3000.0,
  13: 1300.0},
 'COMM': {0: nan,
  1: 300.0,
  2: 500.0,
  3: nan,
  4: 1400.0,
  5: nan,
  6: nan,
  7: nan,
  8: nan,
  9: 0.0,
  10: nan,
  11: nan,
  12: nan,
  13: nan},
 'DEPTNO': {0: 20,
  1: 30,
  2: 30,
  3: 20,
  4: 30,
  5: 30,
  6: 10,
  7: 20,
  8: 10,
  9: 30,
  10: 20,
  11: 30,
  12: 20,
  13: 10}}

In [17]:
db.emp.find_one()

{'_id': ObjectId('6232b71bb5e5ff919f25b358'),
 'EMPNO': '7369',
 'ENAME': 'SMITH',
 'JOB': 'CLERK',
 'MGR': '7902',
 'HIREDATE': '1980-12-17',
 'SAL': '800.00',
 'DEPTNO': '20'}

In [18]:
list(db.emp.find(
    {
        "ENAME" : "SMITH"
    }
))
# SELECT * FROM emp WHERE ENAME = "SMITH"

[{'_id': ObjectId('6232b71bb5e5ff919f25b358'),
  'EMPNO': '7369',
  'ENAME': 'SMITH',
  'JOB': 'CLERK',
  'MGR': '7902',
  'HIREDATE': '1980-12-17',
  'SAL': '800.00',
  'DEPTNO': '20'}]

In [19]:
result = db.emp.find()

for list in result:
    print(list)

{'_id': ObjectId('6232b71bb5e5ff919f25b358'), 'EMPNO': '7369', 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': '7902', 'HIREDATE': '1980-12-17', 'SAL': '800.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71bb5e5ff919f25b359'), 'EMPNO': '7499', 'ENAME': 'ALLEN', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-02-20', 'SAL': '1600.00', 'COMM': '300.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71bb5e5ff919f25b35a'), 'EMPNO': '7521', 'ENAME': 'WARD', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-02-22', 'SAL': '1250.00', 'COMM': '500.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71bb5e5ff919f25b35b'), 'EMPNO': '7566', 'ENAME': 'JONES', 'JOB': 'MANAGER', 'MGR': '7839', 'HIREDATE': '1981-04-02', 'SAL': '2975.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71bb5e5ff919f25b35c'), 'EMPNO': '7654', 'ENAME': 'MARTIN', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-09-28', 'SAL': '1250.00', 'COMM': '1400.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71bb5e5ff919f25b35d'), 'EMPNO': '7698', 'ENAME': 'BLAKE', 'JOB': 'MANAGER', 'MGR': '7839', 'HIREDATE': '1981-05-01', 'SAL': '2850.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71bb5e5ff919f25b35e'), 'EMPNO': '7782', 'ENAME': 'CLARK', 'JOB': 'MANAGER', 'MGR': '7839', 'HIREDATE': '1981-06-09', 'SAL': '2450.00', 'DEPTNO': '10'}
{'_id': ObjectId('6232b71bb5e5ff919f25b35f'), 'EMPNO': '7788', 'ENAME': 'SCOTT', 'JOB': 'ANALYST', 'MGR': '7566', 'HIREDATE': '1987-06-28', 'SAL': '3000.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71bb5e5ff919f25b360'), 'EMPNO': '7839', 'ENAME': 'KING', 'JOB': 'PRESIDENT', 'HIREDATE': '1981-11-17', 'SAL': '5000.00', 'DEPTNO': '10'}
{'_id': ObjectId('6232b71bb5e5ff919f25b361'), 'EMPNO': '7844', 'ENAME': 'TURNER', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-09-08', 'SAL': '1500.00', 'COMM': '0.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71bb5e5ff919f25b362'), 'EMPNO': '7876', 'ENAME': 'ADAMS', 'JOB': 'CLERK', 'MGR': '7788', 'HIREDATE': '1987-07-13', 'SAL': '1100.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71bb5e5ff919f25b363'), 'EMPNO': '7900', 'ENAME': 'JAMES', 'JOB': 'CLERK', 'MGR': '7698', 'HIREDATE': '1981-12-03', 'SAL': '950.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71bb5e5ff919f25b364'), 'EMPNO': '7902', 'ENAME': 'FORD', 'JOB': 'ANALYST', 'MGR': '7566', 'HIREDATE': '1981-12-03', 'SAL': '3000.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71bb5e5ff919f25b365'), 'EMPNO': '7934', 'ENAME': 'MILLER', 'JOB': 'CLERK', 'MGR': '7782', 'HIREDATE': '1982-01-23', 'SAL': '1300.00', 'DEPTNO': '10'}

In [23]:
## emp collection
## key 값이 EMPNO, ENAME, DEPTNO만 출력이 되도록 코드를 작성
result = db.emp.find(
    {},            # where 조건을 쓸때 사용하는 공간
    {"EMPNO" : 1,
    "ENAME" : 1,
    "DEPTNO" : 1}   #key의 값을 선택할수 있는 공간
)
for list in result:
    print(list)
# SELECT EMPNO, ENAME, DEPTNO FROM emp

{'_id': ObjectId('6232b71bb5e5ff919f25b358'), 'EMPNO': '7369', 'ENAME': 'SMITH', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71bb5e5ff919f25b359'), 'EMPNO': '7499', 'ENAME': 'ALLEN', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71bb5e5ff919f25b35a'), 'EMPNO': '7521', 'ENAME': 'WARD', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71bb5e5ff919f25b35b'), 'EMPNO': '7566', 'ENAME': 'JONES', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71bb5e5ff919f25b35c'), 'EMPNO': '7654', 'ENAME': 'MARTIN', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71bb5e5ff919f25b35d'), 'EMPNO': '7698', 'ENAME': 'BLAKE', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71bb5e5ff919f25b35e'), 'EMPNO': '7782', 'ENAME': 'CLARK', 'DEPTNO': '10'}
{'_id': ObjectId('6232b71bb5e5ff919f25b35f'), 'EMPNO': '7788', 'ENAME': 'SCOTT', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71bb5e5ff919f25b360'), 'EMPNO': '7839', 'ENAME': 'KING', 'DEPTNO': '10'}
{'_id': ObjectId('6232b71bb5e5ff919f25b361'), 'EMPNO': '7844', 'ENAME': 'TURNER', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71bb5e5ff919f25b362'), 'EMPNO': '7876', 'ENAME': 'ADAMS', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71bb5e5ff919f25b363'), 'EMPNO': '7900', 'ENAME': 'JAMES', 'DEPTNO': '30'}
{'_id': ObjectId('6232b71bb5e5ff919f25b364'), 'EMPNO': '7902', 'ENAME': 'FORD', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71bb5e5ff919f25b365'), 'EMPNO': '7934', 'ENAME': 'MILLER', 'DEPTNO': '10'}

In [37]:
result = db.emp.find().sort("ENAME")

for list in result:
    pprint.pprint(list)

# SELECT * FROM emp ORDER BY ENAME

{'DEPTNO': '20',
 'EMPNO': '7876',
 'ENAME': 'ADAMS',
 'HIREDATE': '1987-07-13',
 'JOB': 'CLERK',
 'MGR': '7788',
 'SAL': '1100.00',
 '_id': ObjectId('6232b71bb5e5ff919f25b362')}
{'COMM': '300.00',
 'DEPTNO': '30',
 'EMPNO': '7499',
 'ENAME': 'ALLEN',
 'HIREDATE': '1981-02-20',
 'JOB': 'SALESMAN',
 'MGR': '7698',
 'SAL': '1600.00',
 '_id': ObjectId('6232b71bb5e5ff919f25b359')}
{'DEPTNO': '30',
 'EMPNO': '7698',
 'ENAME': 'BLAKE',
 'HIREDATE': '1981-05-01',
 'JOB': 'MANAGER',
 'MGR': '7839',
 'SAL': '2850.00',
 '_id': ObjectId('6232b71bb5e5ff919f25b35d')}
{'DEPTNO': '10',
 'EMPNO': '7782',
 'ENAME': 'CLARK',
 'HIREDATE': '1981-06-09',
 'JOB': 'MANAGER',
 'MGR': '7839',
 'SAL': '2450.00',
 '_id': ObjectId('6232b71bb5e5ff919f25b35e')}
{'DEPTNO': '20',
 'EMPNO': '7902',
 'ENAME': 'FORD',
 'HIREDATE': '1981-12-03',
 'JOB': 'ANALYST',
 'MGR': '7566',
 'SAL': '3000.00',
 '_id': ObjectId('6232b71bb5e5ff919f25b364')}
{'DEPTNO': '30',
 'EMPNO': '7900',
 'ENAME': 'JAMES',
 'HIREDATE': '1981-12-03',
 'JOB': 'CLERK',
 'MGR': '7698',
 'SAL': '950.00',
 '_id': ObjectId('6232b71bb5e5ff919f25b363')}
{'DEPTNO': '20',
 'EMPNO': '7566',
 'ENAME': 'JONES',
 'HIREDATE': '1981-04-02',
 'JOB': 'MANAGER',
 'MGR': '7839',
 'SAL': '2975.00',
 '_id': ObjectId('6232b71bb5e5ff919f25b35b')}
{'DEPTNO': '10',
 'EMPNO': '7839',
 'ENAME': 'KING',
 'HIREDATE': '1981-11-17',
 'JOB': 'PRESIDENT',
 'SAL': '5000.00',
 '_id': ObjectId('6232b71bb5e5ff919f25b360')}
{'COMM': '1400.00',
 'DEPTNO': '30',
 'EMPNO': '7654',
 'ENAME': 'MARTIN',
 'HIREDATE': '1981-09-28',
 'JOB': 'SALESMAN',
 'MGR': '7698',
 'SAL': '1250.00',
 '_id': ObjectId('6232b71bb5e5ff919f25b35c')}
{'DEPTNO': '10',
 'EMPNO': '7934',
 'ENAME': 'MILLER',
 'HIREDATE': '1982-01-23',
 'JOB': 'CLERK',
 'MGR': '7782',
 'SAL': '1300.00',
 '_id': ObjectId('6232b71bb5e5ff919f25b365')}
{'DEPTNO': '20',
 'EMPNO': '7788',
 'ENAME': 'SCOTT',
 'HIREDATE': '1987-06-28',
 'JOB': 'ANALYST',
 'MGR': '7566',
 'SAL': '3000.00',
 '_id': ObjectId('6232b71bb5e5ff919f25b35f')}
{'DEPTNO': '20',
 'EMPNO': '7369',
 'ENAME': 'SMITH',
 'HIREDATE': '1980-12-17',
 'JOB': 'CLERK',
 'MGR': '7902',
 'SAL': '800.00',
 '_id': ObjectId('6232b71bb5e5ff919f25b358')}
{'COMM': '0.00',
 'DEPTNO': '30',
 'EMPNO': '7844',
 'ENAME': 'TURNER',
 'HIREDATE': '1981-09-08',
 'JOB': 'SALESMAN',
 'MGR': '7698',
 'SAL': '1500.00',
 '_id': ObjectId('6232b71bb5e5ff919f25b361')}
{'COMM': '500.00',
 'DEPTNO': '30',
 'EMPNO': '7521',
 'ENAME': 'WARD',
 'HIREDATE': '1981-02-22',
 'JOB': 'SALESMAN',
 'MGR': '7698',
 'SAL': '1250.00',
 '_id': ObjectId('6232b71bb5e5ff919f25b35a')}

In [54]:
# 급여가 2000보다 큰 데이터만 출력
result = db.emp.find(
    {
        "SAL" : {
            "$gt": 2000
        }
    }
)
for list in result:
    print(list)

# SELECT * FROM emp WHERE SAL > 2000

{'_id': ObjectId('6232c695b5e5ff919f25b37b'), 'EMPNO': 7566, 'ENAME': 'JONES', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-04-02', 'SAL': 2975.0, 'DEPTNO': '20'}
{'_id': ObjectId('6232c695b5e5ff919f25b37d'), 'EMPNO': 7698, 'ENAME': 'BLAKE', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-05-01', 'SAL': 2850.0, 'DEPTNO': '30'}
{'_id': ObjectId('6232c695b5e5ff919f25b37e'), 'EMPNO': 7782, 'ENAME': 'CLARK', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-06-09', 'SAL': 2450.0, 'DEPTNO': '10'}
{'_id': ObjectId('6232c695b5e5ff919f25b37f'), 'EMPNO': 7788, 'ENAME': 'SCOTT', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': '1987-06-28', 'SAL': 3000.0, 'DEPTNO': '20'}
{'_id': ObjectId('6232c695b5e5ff919f25b380'), 'EMPNO': 7839, 'ENAME': 'KING', 'JOB': 'PRESIDENT', 'HIREDATE': '1981-11-17', 'SAL': 5000.0, 'DEPTNO': '10'}
{'_id': ObjectId('6232c695b5e5ff919f25b384'), 'EMPNO': 7902, 'ENAME': 'FORD', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': '1981-12-03', 'SAL': 3000.0, 'DEPTNO': '20'}

In [55]:
# 급여가 2450보다 크거나 같은 데이터만 출력
result = db.emp.find(
    {
        "SAL" : {
            "$gte": 2450
        }
    }
)
for list in result:
    print(list)

# SELECT * FROM emp WHERE SAL >= 2450

{'_id': ObjectId('6232c695b5e5ff919f25b37b'), 'EMPNO': 7566, 'ENAME': 'JONES', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-04-02', 'SAL': 2975.0, 'DEPTNO': '20'}
{'_id': ObjectId('6232c695b5e5ff919f25b37d'), 'EMPNO': 7698, 'ENAME': 'BLAKE', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-05-01', 'SAL': 2850.0, 'DEPTNO': '30'}
{'_id': ObjectId('6232c695b5e5ff919f25b37e'), 'EMPNO': 7782, 'ENAME': 'CLARK', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-06-09', 'SAL': 2450.0, 'DEPTNO': '10'}
{'_id': ObjectId('6232c695b5e5ff919f25b37f'), 'EMPNO': 7788, 'ENAME': 'SCOTT', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': '1987-06-28', 'SAL': 3000.0, 'DEPTNO': '20'}
{'_id': ObjectId('6232c695b5e5ff919f25b380'), 'EMPNO': 7839, 'ENAME': 'KING', 'JOB': 'PRESIDENT', 'HIREDATE': '1981-11-17', 'SAL': 5000.0, 'DEPTNO': '10'}
{'_id': ObjectId('6232c695b5e5ff919f25b384'), 'EMPNO': 7902, 'ENAME': 'FORD', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': '1981-12-03', 'SAL': 3000.0, 'DEPTNO': '20'}

In [57]:
# 급여가 2450보다 작은 데이터만 출력
result = db.emp.find(
    {
        "SAL" : {
            "$lte": 2450
        }
    }
)
for list in result:
    print(list)

# SELECT * FROM emp WHERE SAL < 2450

{'_id': ObjectId('6232c695b5e5ff919f25b378'), 'EMPNO': 7369, 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': 7902, 'HIREDATE': '1980-12-17', 'SAL': 800.0, 'DEPTNO': '20'}
{'_id': ObjectId('6232c695b5e5ff919f25b379'), 'EMPNO': 7499, 'ENAME': 'ALLEN', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': '1981-02-20', 'SAL': 1600.0, 'COMM': 300.0, 'DEPTNO': '30'}
{'_id': ObjectId('6232c695b5e5ff919f25b37a'), 'EMPNO': 7521, 'ENAME': 'WARD', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': '1981-02-22', 'SAL': 1250.0, 'COMM': 500.0, 'DEPTNO': '30'}
{'_id': ObjectId('6232c695b5e5ff919f25b37c'), 'EMPNO': 7654, 'ENAME': 'MARTIN', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': '1981-09-28', 'SAL': 1250.0, 'COMM': 1400.0, 'DEPTNO': '30'}
{'_id': ObjectId('6232c695b5e5ff919f25b37e'), 'EMPNO': 7782, 'ENAME': 'CLARK', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-06-09', 'SAL': 2450.0, 'DEPTNO': '10'}
{'_id': ObjectId('6232c695b5e5ff919f25b381'), 'EMPNO': 7844, 'ENAME': 'TURNER', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': '1981-09-08', 'SAL': 1500.0, 'COMM': 0.0, 'DEPTNO': '30'}
{'_id': ObjectId('6232c695b5e5ff919f25b382'), 'EMPNO': 7876, 'ENAME': 'ADAMS', 'JOB': 'CLERK', 'MGR': 7788, 'HIREDATE': '1987-07-13', 'SAL': 1100.0, 'DEPTNO': '20'}
{'_id': ObjectId('6232c695b5e5ff919f25b383'), 'EMPNO': 7900, 'ENAME': 'JAMES', 'JOB': 'CLERK', 'MGR': 7698, 'HIREDATE': '1981-12-03', 'SAL': 950.0, 'DEPTNO': '30'}
{'_id': ObjectId('6232c695b5e5ff919f25b385'), 'EMPNO': 7934, 'ENAME': 'MILLER', 'JOB': 'CLERK', 'MGR': 7782, 'HIREDATE': '1982-01-23', 'SAL': 1300.0, 'DEPTNO': '10'}

In [62]:
#SELECT * FROM emp WHERE ENAME = SMITH OR ENAME = ALLEN
result = db.emp.find(
    {
        "$or" : [
            {
                "ENAME" : "SMITH"
            },
            {
                "ENAME" : "ALLEN"
            }
        ]
    }
)
for list in result:
    print(list)

{'_id': ObjectId('6232b71bb5e5ff919f25b358'), 'EMPNO': '7369', 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': '7902', 'HIREDATE': '1980-12-17', 'SAL': '800.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b71bb5e5ff919f25b359'), 'EMPNO': '7499', 'ENAME': 'ALLEN', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-02-20', 'SAL': '1600.00', 'COMM': '300.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232c695b5e5ff919f25b378'), 'EMPNO': 7369, 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': 7902, 'HIREDATE': '1980-12-17', 'SAL': 800.0, 'DEPTNO': '20'}
{'_id': ObjectId('6232c695b5e5ff919f25b379'), 'EMPNO': 7499, 'ENAME': 'ALLEN', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': '1981-02-20', 'SAL': 1600.0, 'COMM': 300.0, 'DEPTNO': '30'}

In [63]:
#SELECT * FROM emp WHERE ENAME = SMITH AND JOB = CLERK
result = db.emp.find(
    {
        "ENAME" : "SMITH",
        "JOB" : "CLERK"
    }
)
for list in result:
    print(list)

{'_id': ObjectId('6232b71bb5e5ff919f25b358'), 'EMPNO': '7369', 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': '7902', 'HIREDATE': '1980-12-17', 'SAL': '800.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232c695b5e5ff919f25b378'), 'EMPNO': 7369, 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': 7902, 'HIREDATE': '1980-12-17', 'SAL': 800.0, 'DEPTNO': '20'}

In [67]:
#SELECT * FROM emp WHERE SAL >=2000 AND SAL < 4000
result = db.emp.find(
    {
        "SAL" : {
            "$gte" : 2000,
            "$lt" : 4000
        }
    },
    {
        "_id" : 0
    }
)

pd.DataFrame(result)
# result

   EMPNO  ENAME      JOB   MGR    HIREDATE     SAL DEPTNO
0   7566  JONES  MANAGER  7839  1981-04-02  2975.0     20
1   7698  BLAKE  MANAGER  7839  1981-05-01  2850.0     30
2   7782  CLARK  MANAGER  7839  1981-06-09  2450.0     10
3   7788  SCOTT  ANALYST  7566  1987-06-28  3000.0     20
4   7902   FORD  ANALYST  7566  1981-12-03  3000.0     20

In [81]:
#SELECT * FROM emp WHERE ENAME LIKE %S%
result = db.emp.find(
    {
        "ENAME" : {
            "$regex" : "S"
        }
    }
)
pd.DataFrame(result)

,_id,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,DEPTNO
0,6232b71bb5e5ff919f25b358,7369,SMITH,CLERK,7902,1980-12-17,800.00,20
1,6232b71bb5e5ff919f25b35b,7566,JONES,MANAGER,7839,1981-04-02,2975.00,20
2,6232b71bb5e5ff919f25b35f,7788,SCOTT,ANALYST,7566,1987-06-28,3000.00,20
3,6232b71bb5e5ff919f25b362,7876,ADAMS,CLERK,7788,1987-07-13,1100.00,20
4,6232b71bb5e5ff919f25b363,7900,JAMES,CLERK,7698,1981-12-03,950.00,30
5,6232c695b5e5ff919f25b378,7369,SMITH,CLERK,7902,1980-12-17,800.0,20
6,6232c695b5e5ff919f25b37b,7566,JONES,MANAGER,7839,1981-04-02,2975.0,20
7,6232c695b5e5ff919f25b37f,7788,SCOTT,ANALYST,7566,1987-06-28,3000.0,20
8,6232c695b5e5ff919f25b382,7876,ADAMS,CLERK,7788,1987-07-13,1100.0,20
9,6232c695b5e5ff919f25b383,7900,JAMES,CLERK,7698,1981-12-03,950.0,30

In [82]:
#SELECT * FROM emp WHERE ENAME LIKE S%
result = db.emp.find(
    {
        "ENAME" : {
            "$regex" : "^S"
        }
    }
)
pd.DataFrame(result)

,_id,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,DEPTNO
0,6232b71bb5e5ff919f25b358,7369,SMITH,CLERK,7902,1980-12-17,800.00,20
1,6232b71bb5e5ff919f25b35f,7788,SCOTT,ANALYST,7566,1987-06-28,3000.00,20
2,6232c695b5e5ff919f25b378,7369,SMITH,CLERK,7902,1980-12-17,800.0,20
3,6232c695b5e5ff919f25b37f,7788,SCOTT,ANALYST,7566,1987-06-28,3000.0,20

In [85]:
#SELECT * FROM emp WHERE ENAME LIKE %S
result = db.emp.find(
    {
        "ENAME" : {
            "$regex" : "S$"
        }
    }
)
pd.DataFrame(result)

,_id,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,DEPTNO
0,6232b71bb5e5ff919f25b35b,7566,JONES,MANAGER,7839,1981-04-02,2975.00,20
1,6232b71bb5e5ff919f25b362,7876,ADAMS,CLERK,7788,1987-07-13,1100.00,20
2,6232b71bb5e5ff919f25b363,7900,JAMES,CLERK,7698,1981-12-03,950.00,30
3,6232c695b5e5ff919f25b37b,7566,JONES,MANAGER,7839,1981-04-02,2975.0,20
4,6232c695b5e5ff919f25b382,7876,ADAMS,CLERK,7788,1987-07-13,1100.0,20
5,6232c695b5e5ff919f25b383,7900,JAMES,CLERK,7698,1981-12-03,950.0,30

In [88]:
# SELECT ENAME, JOB, SAL, DEPTNO FROM emp 
# WHERE SAL > 1250 AND 
# SAL <= 3000 AND 
# JOB = SALESMAN 
# ORDER BY ENAME 
result = db.emp.find(
    {
        "SAL" : {
            "$gt" : 1250,
            "$lte" : 3000
        },
        "JOB" : "SALESMAN"
    },
    {
        "ENAME" : 1,
        "JOB" : 1,
        "SAL" : 1,
        "DEPTNO" : 1,
        "_id" : 0
    }
).sort("ENAME", -1)

pd.DataFrame(result)

    ENAME       JOB     SAL DEPTNO
0  TURNER  SALESMAN  1500.0     30
1   ALLEN  SALESMAN  1600.0     30